Revit 2026 API

# ViewPrintedEventArgs Properties

---

The ViewPrintedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate. (Inherited from RevitAPIEventArgs) |
|  | Document | The document associated with the event. (Inherited from RevitAPIPostDocEventArgs) |
|  | Index | The index of the view being printed out of the set of all views being printed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from RevitAPIEventArgs) |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). (Inherited from RevitAPIPostEventArgs) |
|  | TotalViews | The number of all views being printed. |
|  | View | The view that was printed. |

#### Reference

ViewPrintedEventArgs Class

Autodesk.Revit.DB.Events Namespace